<a href="https://colab.research.google.com/github/dudaspm/IST210-Spring2020/blob/master/SQL/Lab3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Lab 3 - SQL on a single table

***Important***


1.   Go to File > Save a Copy to Drive (this will save to your local Google Drive)
2.   Make sure you work through this notebook from top to bottom and run each Code cell

I will take care of getting the data, starting SQL on the notebook, and creating the database.

In [0]:
#Used to make requests
import urllib

f = urllib.request.urlopen("https://gist.githubusercontent.com/dudaspm/2cc247b1b43f1ebf620c1004dd2a0f76/raw/ecdb8dd0f2f851994f10d6612d398702a2d73d4c/StateCollege2010-2020.csv")
StateCollegeWeatherData = str(f.read().decode('utf-8'))

In [2]:
%load_ext sql
%sql sqlite:///SQLon1Table.db

'Connected: @SQLon1Table.db'

***Your Turn***

Here is your ER Diagram

![weather ER Diagram](https://raw.githubusercontent.com/dudaspm/IST210-Spring2020/master/SQL/images/weather.png)

I've added a statement to drop (delete) the table. You need to create the table.

In [5]:
%%sql
DROP TABLE IF EXISTS Weather;
-- ## DELETE ME and add CREATE the table

 * sqlite:///SQLon1Table.db
Done.
Done.

[]

Use this statement to check to make sure your database and table are working properly. Insert the following data manually with an insert statement. 

date | precipation | snow | temp_max | temp_min
--- | --- | --- | --- | ---
2020-01-01 | .1 | .3 | 40 | 28 

Correct any issues first, then move to the next step.

In [0]:
%%sql
DROP TABLE IF EXISTS Weather;
-- ## DELETE ME and add INSERT statement

I will now insert the rest of the data (make sure your table works first by doing the step above!)

In [0]:
%%capture
for line in StateCollegeWeatherData.split("\n")[1:]:
  d = line.split(",")
  date = d[0]
  precipitation = d[1]
  snow = d[2]
  temp_max = d[3]
  temp_min = d[4]
  %sql insert into Weather values (:date,:precipitation,:snow,:temp_max,:temp_min)

Use this select statement to make sure everything working properly.

In [7]:
%%sql
select * from weather limit 10;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18),
 ('2010-01-06', 0.05, 0.7, 27, 18),
 ('2010-01-07', 0.0, 0.0, 30, 25),
 ('2010-01-08', 0.06, 1.2, 29, 21),
 ('2010-01-09', 0.02, 0.4, 24, 16),
 ('2010-01-10', 0.0, 0.0, 27, 8)]

### Lab questions.

Here are the question you will answer for the lab and you will need to:


1.   Copy the question
2.   Copy your SQL query
3.   Copy the output from the query

#### Q1

Which days was the max temperature greater than or equal to 55, but we still had snow?

In [41]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

#### Q2

What day did we have the most precipation?

In [42]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

#### Q3

What is the lowest minimal temperature in which we also had snow?

In [43]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

#### Q4

Fun fact! I was born on the hottest day in history (for December in the state of Pennsylvania). It was 82 degrees. What was the weather like for each December 3rd for each year? Hint: Yes, there are more efficient ways of doing this; we just haven't learned them yet.

In [44]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

#### Q5

Pennsylvania has had some weird temperatures. What day did we have the largest discrepancy from the minimal temperature and the max temperature (hint: you can subtract in SQL)? I want to know the date, the largest difference, the minimal temperature, and max temperature.

In [45]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]

#### Q6

What are the number of days AND the average temperature for days that have snow?

In [46]:
%%sql
select * from weather limit 5;

 * sqlite:///SQLon1Table.db
Done.

[('2010-01-01', 0.07, 0.9, 32, 25),
 ('2010-01-02', 0.0, 0.0, 37, 18),
 ('2010-01-03', 0.0, 0.0, 20, 12),
 ('2010-01-04', 0.0, 0.0, 21, 13),
 ('2010-01-05', 0.0, 0.0, 25, 18)]